app/controllers/authors/accounts_controller.rb

UPDATE "authors" SET "name" = $1, "bio" = $2, "updated_at" = $3 WHERE "authors"."id" = $4  [["name", "Thien"], ["bio", ""], ["updated_at", "2018-04-09 08:09:11.184474"], ["id", 1]]
---
    def update_info
      if current_author.update(author_info_params)