app/controllers/authors/posts_controller.rb

    def create
      @post = current_author.post.new(post_params)

      respond_to do |format|
        if @post.save
---
INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
      respond_to do |format|
        if @post.update(post_params)
---
UPDATE "posts" SET "banner_image_url" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["banner_image_url", "/app/abc"], ["updated_at", "2018-04-09 09:14:25.571771"], ["id", 1]]